Revit 2027 API
LeadersPresentationMode Enumeration
 Leaders Presentation Mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum LeadersPresentationMode
Public Enumeration LeadersPresentationMode
public enum class LeadersPresentationMode
type LeadersPresentationMode
Members
Member name | Value | Description
HideAll | 1 |  Hide all tag leaders.
ShowAll | 0 |  Show all tag leaders.
ShowOnlyOne | 2 |  Show only one leader.
ShowSpecificLeaders | 3 |  Show specific leaders.
See Also
Reference
Autodesk.Revit.DB Namespace